app/controllers/cities_controller.rb

INSERT INTO "cities" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "MYYY"], ["created_at", "2017-09-13 07:34:04.741365"], ["updated_at", "2017-09-13 07:34:04.741365"]]
---
  def create
    @city = City.new(city_params)

    if @city.save